Revit 2017 API
PropertySetLibrary Class
 A named collection of property sets.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2012
Syntax
C#
[ObsoleteAttribute("This class is deprecated in Revit 2013.")]
public class PropertySetLibrary : Element
Visual Basic
<ObsoleteAttribute("This class is deprecated in Revit 2013.")> _
Public Class PropertySetLibrary _
	Inherits Element
Visual C++
[ObsoleteAttribute(L"This class is deprecated in Revit 2013.")]
public ref class PropertySetLibrary : public Element
Remarks
 This class can still read and write property set libraries, but the format it uses is not compatible with the native Revit adsklib property set library file format. It may be used for short term use to save and restore a user's own property sets, but this class may be removed in a future version of Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.PropertySetLibrary
See Also
PropertySetLibrary Members
Autodesk.Revit.DB Namespace